stephenshizl/kwproject/Sources/Middleware/Wireless/ieee_802_15_4_5.3.2/phy/source/MKW41Z/PhyStateMachine.c
#if gMWS_Enabled_d
    OSA_InterruptDisable();
#else
    ProtectFromXcvrInterrupt();
#endif

    /* Handling messages from upper layer */
    while( MSG_Pending(&pPhyStruct->macPhyInputQueue) )
    {
        status = gPhySuccess_c;
        state = PhyGetSeqState();

        /* Check if PHY is busy */
        if( (state != gIdle_c) && (state != gRX_c) )
        {
            status = gPhyBusy_c;
        }
        else
        {
            /* PHY doesn't free dynamic alocated messages! */
            pMsgIn = MSG_DeQueue( &pPhyStruct->macPhyInputQueue );
            pPhyStruct->currentMacInstance = pMsgIn->macInstance;

#if gMWS_Enabled_d
            /* Dual Mode */
            if( (Phy_GetSeqDuration(pMsgIn) + mPhyOverhead_d) <= (MWS_GetInactivityDuration(gMWS_802_15_4_c) / 16) )
            {
                if( !mXcvrAcquired )
                {
                    if( gMWS_Success_c == MWS_Acquire(gMWS_802_15_4_c, FALSE) )
                    {
                        mXcvrAcquired = 1;
                    }
                    else
                    {
                        status = gPhyBusy_c;
                    }
                }
            }
            else
            {
                status = gPhyBusy_c;

                if( mXcvrAcquired && (state == gIdle_c) )
                {
                    mXcvrAcquired = 0;
                    MWS_Release(gMWS_802_15_4_c);
                }
            }

            if( gPhyBusy_c == status )
            {
                /* Failure! Try again later */
                MSG_QueueHead( &pPhyStruct->macPhyInputQueue, pMsgIn );
            }
#endif
        }

        if( gPhyBusy_c == status )
        {
            break;
        }

        if( gRX_c == state )
        {
            state = gIdle_c;
            PhyPlmeForceTrxOffRequest();
        }

#if gMpmIncluded_d
        if( status == gPhySuccess_c )
        {
            status = MPM_PrepareForTx( pMsgIn->macInstance );
        }
#endif

        if( status == gPhySuccess_c )
        {
            pPhyStruct->flags &= ~(gPhyFlagIdleRx_c);

            switch( pMsgIn->msgType )
            {
            case gPdDataReq_c:
                status = Phy_HandlePdDataReq( pPhyStruct, (macToPdDataMessage_t *)pMsgIn );
                break;
            case gPlmeCcaReq_c:
                status = PhyPlmeCcaEdRequest(gPhyCCAMode1_c, gPhyContCcaDisabled);
                break;
            case gPlmeEdReq_c:
                status = PhyPlmeCcaEdRequest(gPhyEnergyDetectMode_c, gPhyContCcaDisabled);
                break;
            default:
                status = gPhyInvalidPrimitive_c;
                break;
            }
        }

        /* Check status */
        if( gPhySuccess_c != status )
        {
            switch( pMsgIn->msgType )
            {
            case gPdDataReq_c:
                PD_SendMessage(pPhyStruct, gPdDataCnf_c);
                break;
                /* Fallthorough */
            case gPlmeCcaReq_c:
                pPhyStruct->channelParams.channelStatus = gPhyChannelBusy_c;
                PLME_SendMessage(pPhyStruct, gPlmeCcaCnf_c);
                break;
            case gPlmeEdReq_c:
                pPhyStruct->channelParams.energyLeveldB = 0;
                PLME_SendMessage(pPhyStruct, gPlmeEdCnf_c);
                break;
            default:
                PLME_SendMessage(pPhyStruct, gPlmeTimeoutInd_c);
                break;
            }
        }
    }/* while( MSG_Pending(&pPhyStruct->macPhyInputQueue) ) */

#if !gMWS_Enabled_d
    UnprotectFromXcvrInterrupt();
#endif

    /* Check if PHY can enter Idle state */
    if( gIdle_c == PhyGetSeqState() )
    {
        Phy_EnterIdle( pPhyStruct );
    }

#if gMWS_Enabled_d
    if(MWS_GetActiveProtocol() == gMWS_None_c)
    {
        MWS_SignalIdle(gMWS_802_15_4_c);
    }

    OSA_InterruptEnable();
#endif
}

/*! *********************************************************************************
* \brief  This is the PD SAP message handler
*
* \param[in]  pMsg Pointer to the PD request message
* \param[in]  instanceId The instance of the PHY
*
* \return  The status of the operation.
*
********************************************************************************** */
phyStatus_t MAC_PD_SapHandler(macToPdDataMessage_t *pMsg, instanceId_t phyInstance)
{
    phyStatus_t result = gPhySuccess_c;
    uint8_t baseIndex = 0;

	phyInstance += 0;

    if( NULL == pMsg )
    {
        result = gPhyInvalidParameter_c;
    }
    else
    {
#if gMpmIncluded_d
        if( pMsg->msgType == gPdIndQueueInsertReq_c || pMsg->msgType == gPdIndQueueRemoveReq_c )
        {
            baseIndex = MPM_GetRegSet( MPM_GetPanIndex(pMsg->macInstance) );
            baseIndex =
#if gPhyUseNeighborTable_d
                baseIndex * (gPhyHwIndQueueSize_d/gMpmPhyPanRegSets_c) +
#endif
                    baseIndex * (gPhyIndirectQueueSize_c/gMpmPhyPanRegSets_c);
        }
#endif

        switch( pMsg->msgType )
        {
        case gPdIndQueueInsertReq_c:
            result = PhyPp_IndirectQueueInsert(baseIndex + pMsg->msgData.indQueueInsertReq.index,
                                               pMsg->msgData.indQueueInsertReq.checksum,
                                               phyInstance);
            break;

        case gPdIndQueueRemoveReq_c:
            result = PhyPp_RemoveFromIndirect(baseIndex + pMsg->msgData.indQueueRemoveReq.index,
                                              phyInstance);
            break;

        case gPdDataReq_c:
            MSG_Queue(&phyLocal.macPhyInputQueue, pMsg);
            Phy24Task( &phyLocal );
            break;

        default:
            result = gPhyInvalidPrimitive_c;
            break;
        }
    }

    return result;
}

/*! *********************************************************************************
* \brief  This is the PLME SAP message handler
*
* \param[in]  pMsg Pointer to the PLME request message
* \param[in]  instanceId The instance of the PHY
*
* \return  phyStatus_t The status of the operation.
*
********************************************************************************** */
phyStatus_t MAC_PLME_SapHandler(macToPlmeMessage_t * pMsg, instanceId_t phyInstance)
{
    Phy_PhyLocalStruct_t *pPhyStruct = &phyLocal;
    phyStatus_t result = gPhySuccess_c;
    uint8_t phyRegSet = 0;
#if gMpmIncluded_d
    int32_t panIdx = MPM_GetPanIndex( pMsg->macInstance );

    phyRegSet = MPM_GetRegSet( panIdx );
#endif

    if( NULL == pMsg )
    {
        result = gPhyInvalidParameter_c;
    }
    else
    {
        switch( pMsg->msgType )
        {
        case gPlmeEdReq_c:
        case gPlmeCcaReq_c:
            MSG_Queue(&phyLocal.macPhyInputQueue, pMsg);
            Phy24Task( &phyLocal );
            break;

        case gPlmeSetReq_c:
#if gMpmIncluded_d
            result = MPM_SetPIB(pMsg->msgData.setReq.PibAttribute,
                                &pMsg->msgData.setReq.PibAttributeValue,
                                panIdx );
            if( !MPM_isPanActive(panIdx) )
            {
                break;
            }
#endif
            result = PhyPlmeSetPIBRequest(pMsg->msgData.setReq.PibAttribute, pMsg->msgData.setReq.PibAttributeValue, phyRegSet, phyInstance);
            break;

        case gPlmeGetReq_c:
#if gMpmIncluded_d
            if( gPhySuccess_c == MPM_GetPIB(pMsg->msgData.getReq.PibAttribute, pMsg->msgData.getReq.pPibAttributeValue, panIdx) )
            {
                break;
            }
#endif
            result = PhyPlmeGetPIBRequest( pMsg->msgData.getReq.PibAttribute, pMsg->msgData.getReq.pPibAttributeValue, phyRegSet, phyInstance);
            break;

