stephenshizl/kwproject/Sources/Middleware/Wireless/ieee_802_15_4_5.3.2/phy/source/MKW41Z/PhyStateMachine.c
        case gPlmeSetTRxStateReq_c:
            if(gPhySetRxOn_c == pMsg->msgData.setTRxStateReq.state)
            {
                /* Compensate Rx warmup time */
                if( pMsg->msgData.setTRxStateReq.startTime != gPhySeqStartAsap_c )
                {
                    pMsg->msgData.setTRxStateReq.startTime -= ((XCVR_TSM->END_OF_SEQ & XCVR_TSM_END_OF_SEQ_END_OF_RX_WU_MASK) >> XCVR_TSM_END_OF_SEQ_END_OF_RX_WU_SHIFT) >> 4; /* /16 */
                }

                pMsg->msgData.setTRxStateReq.rxDuration += ((XCVR_TSM->END_OF_SEQ & XCVR_TSM_END_OF_SEQ_END_OF_RX_WU_MASK) >> XCVR_TSM_END_OF_SEQ_END_OF_RX_WU_SHIFT) >> 4; /* /16 */

#if gMWS_Enabled_d
                if( (MWS_GetInactivityDuration(gMWS_802_15_4_c) / 16) < (pMsg->msgData.setTRxStateReq.rxDuration + mPhyOverhead_d) )
                {
                    result = gPhyBusy_c;
                    break;
                }
#endif
                if( PhyIsIdleRx(phyInstance) )
                {
                    PhyPlmeForceTrxOffRequest();
                }
                else
                {
                    if( gIdle_c != PhyGetSeqState() )
                    {
                        result = gPhyBusy_c;
                        break;
                    }
                }
#if gMpmIncluded_d
                /* If another PAN has the RxOnWhenIdle PIB set, enable the DualPan Auto mode */
                if( gPhySuccess_c != MPM_PrepareForRx( pMsg->macInstance ) )
                {
                    result = gPhyBusy_c;
                    break;
                }
#endif
                pPhyStruct->flags &= ~(gPhyFlagIdleRx_c);

                Phy_SetSequenceTiming(pMsg->msgData.setTRxStateReq.startTime,
                                      pMsg->msgData.setTRxStateReq.rxDuration);

                result = PhyPlmeRxRequest(pMsg->msgData.setTRxStateReq.slottedMode, (phyRxParams_t *) &pPhyStruct->rxParams);
                break;
            }
            else
            {
                if (gPhyForceTRxOff_c == pMsg->msgData.setTRxStateReq.state)
                {
#if gMpmIncluded_d
                    if( !MPM_isPanActive(panIdx) )
                    {
                        break;
                    }
#endif
                    pPhyStruct->flags &= ~(gPhyFlagIdleRx_c);
                    PhyPlmeForceTrxOffRequest();
#if gMWS_Enabled_d
                    mXcvrAcquired = 0;
                    MWS_Release(gMWS_802_15_4_c);
#endif
                }
            }
            break;

        default:
            result = gPhyInvalidPrimitive_c;
            break;
        }
    }
    return result;
}

/*! *********************************************************************************
* \brief  This function programs a new TX sequence
*
* \param[in]  pMsg Pointer to the PD request message
* \param[in]  pPhyData pointer to PHY data
*
* \return  The status of the operation.
*
********************************************************************************** */
static phyStatus_t Phy_HandlePdDataReq( Phy_PhyLocalStruct_t *pPhyData, macToPdDataMessage_t * pMsg )
{
    phyStatus_t status = gPhySuccess_c;
    phyTime_t startTime = gPhySeqStartAsap_c;
    phyTime_t t;

    if( NULL == pMsg->msgData.dataReq.pPsdu )
    {
        status = gPhyInvalidParameter_c;
    }
    else
    {
        ProtectFromXcvrInterrupt();

        /* Compensate XCVR Tx warmup time */
        if( pMsg->msgData.dataReq.startTime != gPhySeqStartAsap_c )
        {
            startTime = pMsg->msgData.dataReq.startTime - (((XCVR_TSM->END_OF_SEQ & XCVR_TSM_END_OF_SEQ_END_OF_TX_WU_MASK) >> XCVR_TSM_END_OF_SEQ_END_OF_TX_WU_SHIFT) >> 4); /* /16 */
            PhyTimeSetEventTrigger( startTime );
        }

        status = PhyPdDataRequest(&pMsg->msgData.dataReq , &pPhyData->rxParams, &pPhyData->txParams);

        t = PhyTime_GetTimestamp();

        if( t > startTime )
        {
            status = gPhyTRxOff_c;
        }
        else
        {
            if( pMsg->msgData.dataReq.txDuration != 0xFFFFFFFFU )
            {
                if( startTime != gPhySeqStartAsap_c )
                {
                    t = startTime + pMsg->msgData.dataReq.txDuration;
                }
                else
                {
                    t += pMsg->msgData.dataReq.txDuration;
                }
                /* Compensate PHY overhead */
                t += ((XCVR_TSM->END_OF_SEQ & XCVR_TSM_END_OF_SEQ_END_OF_TX_WU_MASK) >> XCVR_TSM_END_OF_SEQ_END_OF_TX_WU_SHIFT) >> 4; /* /16 */
                t += 10;
                PhyTimeSetEventTimeout( &t );
            }
        }

        UnprotectFromXcvrInterrupt();

        if( gPhySuccess_c != status )
        {
            PhyPlmeForceTrxOffRequest();
        }
    }
    return status;
}

/*! *********************************************************************************
* \brief  This function sets the start time and the timeout value for a sequence.
*
* \param[in]  startTime The absolute start time for the sequence.
*             If startTime is gPhySeqStartAsap_c, the start timer is disabled.
* \param[in]  seqDuration The duration of the sequence.
*             If seqDuration is 0xFFFFFFFF, the timeout is disabled.
*
********************************************************************************** */
void Phy_SetSequenceTiming(phyTime_t startTime, uint32_t seqDuration)
{
    phyTime_t endTime;

    OSA_InterruptDisable();

    if( gPhySeqStartAsap_c == startTime )
    {
        PhyTimeReadClock( &endTime );
    }
    else
    {
        PhyTimeSetEventTrigger( startTime );
        endTime = startTime & gPhyTimeMask_c;
    }

    if( 0xFFFFFFFFU != seqDuration )
    {
        endTime += seqDuration;
        endTime = endTime & gPhyTimeMask_c;

        PhyTimeSetEventTimeout( &(endTime) );
    }

    OSA_InterruptEnable();
}

/*! *********************************************************************************
* \brief  This function starts the IdleRX if the PhyRxOnWhenIdle PIB is set
*
* \param[in]  pPhyData pointer to PHY data
*
********************************************************************************** */
static void Phy_EnterIdle( Phy_PhyLocalStruct_t *pPhyData )
{
    if( (pPhyData->flags & gPhyFlagRxOnWhenIdle_c)
#if gMpmIncluded_d
       /* Prepare the Active PAN/PANs */
       && (gPhySuccess_c == MPM_PrepareForRx(gInvalidInstanceId_c))
#endif
      )
    {
        uint32_t t = mPhyMaxIdleRxDuration_c;

