stephenshizl/kwproject/Sources/Middleware/Wireless/ieee_802_15_4_5.3.2/phy/source/MKW41Z/PhyStateMachine.c
            pPhyStruct->PLME_MAC_SapHandler(pMsg, pPhyStruct->currentMacInstance);
        }
    }
}

/*! *********************************************************************************
* \brief  Senf a PD message to upper layer
*
* \param[in]  instanceId The instance of the PHY
* \param[in]  msgType    The type of message to be sent
*
********************************************************************************** */
static void PD_SendMessage(Phy_PhyLocalStruct_t *pPhyStruct, phyMessageId_t msgType)
{
    pdDataToMacMessage_t *pMsg;

    if( pPhyStruct->PD_MAC_SapHandler )
    {
        if( msgType == gPdDataInd_c )
        {
            uint32_t temp;
            uint16_t len = pPhyStruct->rxParams.psduLength - 2; /* Excluding FCS (2 bytes) */

            pMsg = pPhyStruct->rxParams.pRxData;
            pPhyStruct->rxParams.pRxData = NULL;

            FLib_MemCpy((uint8_t *)(pMsg->msgData.dataInd.pPsdu), (void*)ZLL->PKT_BUFFER_RX, len);

            pMsg->msgType                         = gPdDataInd_c;
            pMsg->msgData.dataInd.ppduLinkQuality = pPhyStruct->rxParams.linkQuality;
            pMsg->msgData.dataInd.psduLength      = len;

            pMsg->msgData.dataInd.timeStamp       = PhyTime_GetTimestamp();      /* current timestamp (64bit) */
            temp = (uint32_t)(pMsg->msgData.dataInd.timeStamp & gPhyTimeMask_c); /* convert to 24bit */
            pMsg->msgData.dataInd.timeStamp -= (temp - pPhyStruct->rxParams.timeStamp) & gPhyTimeMask_c;
#if !(gMpmIncluded_d)
            pPhyStruct->PD_MAC_SapHandler(pMsg, pPhyStruct->currentMacInstance);
#else
            {
                uint32_t i, bitMask = PhyPpGetPanOfRxPacket();

                for( i=0; i<gMpmPhyPanRegSets_c; i++ )
                {
                    if( bitMask & (1 << i) )
                    {
                        bitMask &= ~(1 << i);
                        pPhyStruct->currentMacInstance = MPM_GetMacInstanceFromRegSet(i);

                        /* If the packet passed filtering on muliple PANs, send a copy to each one */
                        if( bitMask )
                        {
                            pdDataToMacMessage_t *pDataIndCopy;

                            pDataIndCopy = Phy_BufferAlloc(sizeof(pdDataToMacMessage_t) + len);
                            if( pDataIndCopy )
                            {
                                FLib_MemCpy(pDataIndCopy, pMsg, sizeof(pdDataToMacMessage_t) + len);
                                pPhyStruct->PD_MAC_SapHandler(pDataIndCopy, pPhyStruct->currentMacInstance);
                            }
                        }
                        else
                        {
                            pPhyStruct->PD_MAC_SapHandler(pMsg, pPhyStruct->currentMacInstance);
                            break;
                        }
                    }
                }
            }
#endif
        }
        else
        {
            phyStatus_t status;

            if( (pPhyStruct->flags & gPhyFlagRxFP_c) == gPhyFlagRxFP_c )
            {
                pPhyStruct->flags &= ~(gPhyFlagRxFP_c);
                status = gPhyFramePending_c;
            }
            else
            {
                status = gPhySuccess_c;
            }

            pMsg = Phy_BufferAlloc(sizeof(phyMessageHeader_t) + sizeof(pdDataCnf_t));

            if(NULL == pMsg)
            {
                phyTimeEvent_t ev;

                ev.callback = Phy_SendLatePD;
                ev.parameter = (uint32_t)msgType;
                ev.timestamp = gPhyRxRetryInterval_c + PhyTime_GetTimestamp();
                PhyTime_ScheduleEvent(&ev);
            }
            else
            {
                pMsg->msgType = gPdDataCnf_c;
                pMsg->msgData.dataCnf.status = status;
                pPhyStruct->PD_MAC_SapHandler(pMsg, pPhyStruct->currentMacInstance);
            }
        }
    }
}


static void Phy_SendLatePLME( uint32_t param )
{
    PLME_SendMessage(&phyLocal, (phyMessageId_t)param);
}

static void Phy_SendLatePD( uint32_t param )
{
    PD_SendMessage(&phyLocal, (phyMessageId_t)param);
}

void Radio_Phy_Notify(void)
{
    Phy24Task(&phyLocal);
}

#if (gMWS_Enabled_d) || (gMWS_UseCoexistence_d)
/*! *********************************************************************************
* \brief  This function represents the callback used by the MWS module to signal
*         events to the 802.15.4 PHY
*
* \param[in]  event - the MWS event
*
* \return  status
*
********************************************************************************** */
static uint32_t MWS_802_15_4_Callback ( mwsEvents_t event )
{
    uint32_t status = 0;
    uint8_t xcvrState;

    switch(event)
    {
    case gMWS_Init_c:
#if gMWS_Enabled_d
        mXcvrAcquired = 0;
#endif
        break;

    case gMWS_Active_c:
        XCVR_ChangeMode(ZIGBEE_MODE, DR_500KBPS);
        XCVR_MISC->BLE_ARB_CTRL |= XCVR_CTRL_BLE_ARB_CTRL_BLE_RELINQUISH_MASK;
        break;

    case gMWS_Idle_c:
        Phy24Task(&phyLocal);
        break;

    case gMWS_Abort_c:
#if gMWS_Enabled_d
        mXcvrAcquired = 0;
#endif
        xcvrState = PhyGetSeqState();
        PhyAbort();
        switch(xcvrState)
        {
        case gCCA_c:
            if( gCcaED_c == (ZLL->PHY_CTRL & ZLL_PHY_CTRL_CCATYPE_MASK) >> ZLL_PHY_CTRL_CCATYPE_SHIFT )
            {
                phyLocal.channelParams.energyLeveldB = (ZLL->LQI_AND_RSSI & ZLL_LQI_AND_RSSI_CCA1_ED_FNL_MASK) >> ZLL_LQI_AND_RSSI_CCA1_ED_FNL_SHIFT;
                PLME_SendMessage(&phyLocal, gPlmeEdCnf_c);
                break;
            }
        case gTX_c:
        case gTR_c:
            phyLocal.channelParams.channelStatus = gPhyChannelBusy_c;
            PLME_SendMessage(&phyLocal, gPlmeCcaCnf_c);
            break;
        case gRX_c:
            break;
        default:
            PLME_SendMessage(&phyLocal, gPlmeTimeoutInd_c);
            break;
        }
        break;

    case gMWS_GetInactivityDuration_c:
        /* Default status is 0 (Busy)  */
        if( gIdle_c == PhyGetSeqState() )
        {
            status = 0xFFFFFFFF;
        }
        break;

    default:
        status = gMWS_InvalidParameter_c;
        break;
    }

    return status;
}

/*! *********************************************************************************
* \brief  This function returns the duration of the PHY request in symbols
*
* \param[in]  pMsg Pointer to the PHY request message
*
* \return  seq duration in symbols
*
********************************************************************************** */
static uint32_t Phy_GetSeqDuration(phyMessageHeader_t * pMsg)
{
    uint32_t duration;

    /* Compute the duration of the sequence */
    switch( pMsg->msgType )
    {
    case gPdDataReq_c:
        duration = ((macToPdDataMessage_t *)pMsg)->msgData.dataReq.txDuration;
        break;
    case gPlmeCcaReq_c:
    case gPlmeEdReq_c:
        duration = gCCATime_c + gPhyTurnaroundTime_c;
        break;
    default:
        duration = 0;
    }

    return duration;
}

#endif
